tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Shell extension to jump to frequently used directories
brew "autojump"
# .NET Core
brew "dotnet@6"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Tools and libraries to manipulate images in many formats
# brew "imagemagick"
# Turn movies into GIFs
brew "gifify"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Image processing tools collection
# brew "graphicsmagick"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Monitor data's progress through a pipe
brew "pv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Application uninstaller
cask "appcleaner"
# Utility to create and modify archives
cask "betterzip"
# Web browser focusing on privacy
cask "brave-browser"
# Test localhost and staging websites
cask "browserstacklocal"
# Clipboard extension app
cask "clipy"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Visually compare and merge files
cask "diffmerge"
# Tool to build a system install disk
cask "diskmaker-x"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Companion app for scanner hardware
cask "doxie"
# QuickLook generator and Spotlight importer
cask "epubquicklook"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-go-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-lgc-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-profont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# iPhone management application
cask "imazing"
# Menu bar calendar
cask "itsycal"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Software for Logitech devices
cask "logitech-options"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Remote desktop client
# cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Photo organizer
cask "mylio"
# App to write, plan, collaborate, and get organized
cask "notion"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
cask "quicklook-pat"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "spectacle"
# Music streaming service
cask "spotify"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Quicklook extension for source files
cask "syntax-highlight"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Time tracker
cask "toggl-track"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "webpquicklook"
# JavaScript IDE
cask "webstorm"
mas "Enpass", id: 732710998
mas "Grammarly for Safari", id: 1462114288
mas "Kindle", id: 405399194
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Polyglot", id: 1471801525
mas "SiteSucker", id: 442168834
mas "Toggl Track", id: 1291898086
mas "Twitter", id: 409789998
mas "Vectornator Pro", id: 1470168007
mas "WhatsApp", id: 1147396723
vscode "aaron-bond.better-comments"
vscode "ahebrank.yaml2json"
vscode "alefragnani.separators"
vscode "alexkrechik.cucumberautocomplete"
vscode "be5invis.toml"
vscode "BriteSnow.vscode-toggle-quotes"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "CodeSandbox-io.codesandbox-projects"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "diegofn.vscode-uriencode"
vscode "dkundel.vscode-npm-source"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.auto-close-tag"
vscode "GitHub.remotehub"
vscode "IBM.output-colorizer"
vscode "kisstkondoros.vscode-codemetrics"
vscode "MelodicDevelopment.azure-work-management"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "mikestead.dotenv"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "muhajirframe.vscode-react-emotion"
vscode "naumovs.theme-oceanicnext"
vscode "nhoizey.gremlins"
vscode "NuclleaR.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "piotr-porzuczek.jest-cucumber-code-generator-extension"
vscode "PKief.material-icon-theme"
vscode "Ponicode.ponicode"
vscode "pranaygp.vscode-css-peek"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "sodatea.velocity"
vscode "steoates.autoimport"
vscode "syler.sass-indented"
vscode "timkmecl.chatgpt"
vscode "tinkertrain.theme-panda"
vscode "vector-of-bool.gitflow"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vunguyentuan.vscode-postcss"
vscode "WilsonWong.caniuse-query"
vscode "wix.vscode-import-cost"
vscode "xabikos.JavaScriptSnippets"
vscode "xyz.local-history"
vscode "Zignd.html-css-class-completion"
