tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "romkatv/powerlevel10k"
# Shell extension to jump to frequently used directories
brew "autojump"
# .NET Core
brew "dotnet@6"
# Command-line fuzzy finder written in Go
brew "fzf"
# AVH edition of git-flow
brew "git-flow-avh"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Theme for zsh
brew "powerlevel10k"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Utility to create and modify archives
cask "betterzip"
# Web browser focusing on privacy
# cask "brave-browser"
# Test localhost and staging websites
cask "browserstacklocal"
# Clipboard extension app
cask "clipy"
# Multi-platform client-side cloud file encryption tool
cask "cryptomator"
# Visually compare and merge files
cask "diffmerge"
# Tool to build a system install disk
# cask "diskmaker-x"
# App to build and share containerised applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fantasque-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hasklug-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-go-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-lgc-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-monoid-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-profont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-victor-mono-nerd-font"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# iPhone management application
cask "imazing"
# Menu bar calendar
cask "itsycal"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organised
cask "notion"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Collaboration platform for API development
cask "postman"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
cask "quicklook-pat"
# Quick Look generator for Adobe Swatch Exchange files
cask "quicklookase"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Microsofts instant messaging enterprise software
# cask "skype-for-business"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Sync and backup service to Synology NAS drives
cask "synology-drive"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Quick Look plugin for webp files
cask "webpquicklook"
# JavaScript IDE
cask "webstorm"
mas "Calendars", id: 608834326
mas "Enpass", id: 732710998
mas "hide.me VPN", id: 953040671
# mas "Grammarly for Safari", id: 1462114288
# mas "Kindle", id: 405399194
mas "Microsoft To Do", id: 1274495053
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Polyglot", id: 1471801525
# mas "SiteSucker", id: 442168834
mas "Toggl Track", id: 1291898086
# mas "Twitter", id: 409789998
# mas "Vectornator Pro", id: 1470168007
mas "‎WhatsApp", id: 310633997
vscode "aaron-bond.better-comments"
vscode "ahebrank.yaml2json"
vscode "alefragnani.bookmarks"
vscode "alefragnani.separators"
vscode "alexkrechik.cucumberautocomplete"
vscode "be5invis.toml"
vscode "britesnow.vscode-toggle-quotes"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "codesandbox-io.codesandbox-projects"
vscode "codezombiech.gitignore"
vscode "codium.codium"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "diegofn.vscode-uriencode"
vscode "dkundel.vscode-npm-source"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "ibm.output-colorizer"
vscode "kisstkondoros.vscode-codemetrics"
vscode "mechatroner.rainbow-csv"
vscode "melodicdevelopment.azure-work-management"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "mikestead.dotenv"
vscode "mohsen1.react-javascript-to-typescript-transform-vscode"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "muhajirframe.vscode-react-emotion"
vscode "naumovs.theme-oceanicnext"
vscode "nhoizey.gremlins"
vscode "nucllear.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "piotr-porzuczek.jest-cucumber-code-generator-extension"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "pranaygp.vscode-css-peek"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "sodatea.velocity"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "tabnine.tabnine-vscode"
vscode "timkmecl.chatgpt"
vscode "tinkertrain.theme-panda"
vscode "usernamehw.errorlens"
vscode "vector-of-bool.gitflow"
vscode "vincaslt.highlight-matching-tag"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vunguyentuan.vscode-postcss"
vscode "wallabyjs.console-ninja"
vscode "wayou.vscode-todo-highlight"
vscode "wilsonwong.caniuse-query"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xyz.local-history"
vscode "zignd.html-css-class-completion"
