tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Shell extension to jump to frequently used directories
brew "autojump"
# Programmable completion for Bash 3.2
# brew "bash-completion"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Turn movies into GIFs
brew "gifify"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Image processing tools collection
brew "graphicsmagick"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Platform built on V8 to build network applications
brew "node"
# Monitor data's progress through a pipe
brew "pv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
cask "adobe-acrobat-reader"
cask "appcleaner"
cask "balenaetcher"
cask "brave-browser"
cask "ccleaner"
cask "charles"
cask "clipy"
cask "cloudmounter"
cask "cryptomator"
cask "data-rescue"
cask "diffmerge"
cask "disk-sensei"
cask "diskmaker-x"
cask "docker"
cask "doxie"
cask "epubquicklook"
cask "firefox"
cask "firefox-developer-edition"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulentsansmono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstreamverasansmono-nerd-font"
cask "font-blexmono-nerd-font"
cask "font-caskaydiacove-nerd-font"
cask "font-codenewroman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddytimemono-nerd-font"
cask "font-dejavusansmono-nerd-font"
cask "font-droidsansmono-nerd-font"
cask "font-fantasquesansmono-nerd-font"
cask "font-firacode-nerd-font"
cask "font-firamono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-gomono-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavydata-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-imwriting-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-inconsolatago-nerd-font"
cask "font-inconsolatalgc-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrainsmono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-meslolg-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-mplus-nerd-font"
cask "font-noto-nerd-font"
cask "font-opendyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggycleantt-nerd-font"
cask "font-robotomono-nerd-font"
cask "font-saucecodepro-nerd-font"
cask "font-shuretechmono-nerd-font"
cask "font-source-code-pro-for-powerline"
cask "font-spacemono-nerd-font"
cask "font-terminessttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-ubuntumono-nerd-font"
cask "font-victormono-nerd-font"
# cask "forklift"
# cask "franz"
# cask "gas-mask"
cask "ghostlab"
# cask "google-chrome"
cask "google-chrome-canary"
cask "grammarly"
cask "handbrake"
cask "hetimazipql"
# cask "imageoptim"
cask "imazing"
cask "itsycal"
cask "java"
cask "jetbrains-toolbox"
cask "kitematic"
# cask "macpass"
# cask "microsoft-office"
cask "microsoft-teams"
cask "omnidisksweeper"
cask "onedrive"
cask "onyx"
# cask "osxfuse"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "signal"
cask "skype"
cask "skype-for-business"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
# cask "superduper"
# cask "suspicious-package"
# cask "synology-cloud-station-backup"
cask "synology-drive"
cask "teamviewer"
cask "telegram"
cask "the-unarchiver"
cask "toggl"
cask "ubiquiti-unifi-controller"
# cask "virtualbox"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "webpquicklook"
cask "webstorm"
mas "Enpass", id: 732710998
mas "Grammarly for Safari", id: 1462114288
mas "Microsoft To Do", id: 1274495053
mas "Pages", id: 409201541
mas "Polyglot", id: 1471801525
mas "SiteSucker", id: 442168834
mas "Twitter", id: 409789998
mas "WhatsApp", id: 1147396723
